/** 
 * * Must Knowing Topic from this Module
 * nested অবজেক্ট (অর্থাৎ একটা অবজেক্ট এর প্রপার্টি এর মধ্যেও যে অবজেক্ট থাকতে পারে। আবার সেই অবজেক্ট এর প্রপার্টি এর মধ্যেও যে অবজেক্ট থাকতে পারে। সেটা খেয়াল করতে হবে )
 * ডট এর আগে যে প্রশ্নবোধক চিহ্ন দিয়ে যে অপশনাল চেইনিং করা যায়। সেটা একটু খেয়াল করতে হবে। 
 * 
 * 
 * array এর মধ্যে map কিভাবে করতে হয়। 
 * array এর মধ্যে forEach কিভাবে করে। এবং map এর forEach এর মধ্যে ডিফারেন্স কি
 * filter জিনিসটা দিয়ে কি করা হয়। ফিল্টার যে array রিটার্ন করে সেটা ফিউচারের জন্য খেয়াল রাখতে হবে 
 * find এবং filter এর মধ্যে ডিফারেন্স কি ? 
 * অবজেক্ট এর সিম্পল destructuring কিভাবে করে ?
 * array এর সিম্পল destructuring কিভাবে করে ?
 * 
 * 
 *  class কিভাবে ডিক্লেয়ার করে 
 * inheritance কি জিনিস 
 * prototypical inheritance এর কনসেপ্টটা কি (এইটা মাঝে মধ্যে ইন্টারভিউতে জিজ্ঞেস করে বসে)
*/